In [136]:
import pandas as pd

In [137]:
df = pd.read_csv('uy_bor_data.csv')

In [138]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2444 entries, 0 to 2443
Data columns (total 18 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   titles          2444 non-null   object
 1   rooms           2444 non-null   object
 2   areas           2444 non-null   object
 3   floors          2444 non-null   object
 4   renovations     2444 non-null   object
 5   materials       2444 non-null   object
 6   prices          2444 non-null   object
 7   addresses       2444 non-null   object
 8   lifts           2444 non-null   object
 9   securities      2444 non-null   object
 10  internets       2444 non-null   object
 11  playgrounds     2444 non-null   object
 12  sewerages       2444 non-null   object
 13  bathrooms       2444 non-null   object
 14  video_monitor   2444 non-null   object
 15  parking_spaces  2444 non-null   object
 16  air_conditions  2444 non-null   object
 17  furnitures      2444 non-null   object
dtypes: object(18)
memory usage: 343.8+ KB

In [139]:
df['lifts'].value_counts()

lifts
no lift    1666
1           416
Лифт        362
Name: count, dtype: int64

In [140]:
def convert(value):
  if value == 'Лифт':
    return 1
  elif value == "1":
    return float(1)
  else:
    return float(0)
df['lifts'] = df['lifts'].map(convert)

In [141]:
df['lifts'].value_counts()

lifts
0.0    1666
1.0     778
Name: count, dtype: int64

In [142]:
def convert(value):
  if value == 'No security':
    return float(1)
  else:
    return float(0)
df['securities'] = df['securities'].map(convert)
df['securities'].value_counts()

securities
1.0    2315
0.0     129
Name: count, dtype: int64

In [143]:
def convert(value):
  if value == 'No internet':
    return float(1)
  else:
    return float(0)
df['internets'] = df['internets'].map(convert)
df['internets'].value_counts()

internets
1.0    1644
0.0     800
Name: count, dtype: int64

In [144]:
def convert(value):
  if value == 'No playground':
    return float(1)
  else:
    return float(0)
df['playgrounds'] = df['playgrounds'].map(convert)
df['playgrounds'].value_counts()

playgrounds
1.0    1586
0.0     858
Name: count, dtype: int64

In [145]:
def convert(value):
  if value == 'No sewerage':
    return float(1)
  else:
    return float(0)
df['sewerages'] = df['sewerages'].map(convert)
df['sewerages'].value_counts()

sewerages
1.0    1554
0.0     890
Name: count, dtype: int64

In [146]:
def convert(value):
  if value == 'No bathroom':
    return float(1)
  else:
    return float(0)
df['bathrooms'] = df['bathrooms'].map(convert)
df['bathrooms'].value_counts()

bathrooms
1.0    1787
0.0     657
Name: count, dtype: int64

In [147]:
def convert(value):
  if value == 'No video_monitor':
    return float(1)
  else:
    return float(0)
df['video_monitor'] = df['video_monitor'].map(convert)
df['video_monitor'].value_counts()

video_monitor
1.0    2236
0.0     208
Name: count, dtype: int64

In [148]:
def convert(value):
  if value == 'No parking_space':
    return float(1)
  else:
    return float(0)
df['parking_spaces'] = df['parking_spaces'].map(convert)
df['parking_spaces'].value_counts()

parking_spaces
1.0    1757
0.0     687
Name: count, dtype: int64

In [149]:
def convert(value):
  if value == 'No air_condition':
    return float(1)
  else:
    return float(0)
df['air_conditions'] = df['air_conditions'].map(convert)
df['air_conditions'].value_counts()

air_conditions
1.0    1760
0.0     684
Name: count, dtype: int64

In [150]:
def convert(value):
  if value == 'No furniture':
    return float(1)
  else:
    return float(0)
df['furnitures'] = df['furnitures'].map(convert)
df['furnitures'].value_counts()

furnitures
1.0    1730
0.0     714
Name: count, dtype: int64

In [151]:
def convert_area(value):
  if 'м²' in value:
    value = value.replace('м²', '')
    value = value.strip()
    if ' ' in value:
      value = value.replace(' ', '.')
      return float(value)
    else:
      return float(value)
  elif ' ' in value:
    value = value.replace(' ', '.')
    return float(value)
  else:
    value = value.strip()
    return float(value)
df['areas'] = df['areas'].map(convert_area)
df['areas'].value_counts()

areas
50.00     201
70.00     148
42.00     112
30.00     102
95.00      86
         ...
111.22      1
88.00       1
34.25       1
109.66      1
57.10       1
Name: count, Length: 181, dtype: int64

In [152]:
def room(value):
  if '+' in value:
    value = value.replace('+', '')
    return float(value)
  elif value == 'Свободная планировка':
    value = value.replace('Свободная планировка', '')
    return float(0)
  else:
    return float(value)
df['rooms'] = df['rooms'].map(room)
df['rooms'].value_counts()

rooms
2.0    1033
3.0     573
1.0     534
4.0     263
5.0      34
6.0       5
0.0       2
Name: count, dtype: int64

In [153]:
house_floor = []
floor_th = []
def floor_h(value):
  if '/' in value:
    splt = value.split("/")
    floor_th.append(float(splt[0]))
    house_floor.append(float(splt[1]))
    return value

df['floors'] = df['floors'].apply(floor_h)
# df['floors'].value_counts()
print(len(house_floor))
print(len(floor_th))

2444
2444

In [154]:
df['house_floor'] = house_floor
df['floor_th'] = floor_th

In [155]:
df.drop(['floors'], axis=1, inplace=True)

In [157]:
df['renovations'].value_counts()

renovations
Евроремонт          947
Средний             844
Авторский проект    294
Требует ремонта     234
Черновая отделка    125
Name: count, dtype: int64

In [161]:
def price(value):
  if 'у.е.' in value:
    value = value.replace('у.е.','')
    value = value.strip()
    if ' ' in value:
      value = value.replace(' ','')
      return float(value)
    else:
      return float(value)
  elif value == 'No price':
    return float(0)
  else:
    return float(value)
df['prices'] = df['prices'].map(price)
df['prices'].value_counts()

prices
80000.0    177
61000.0     86
42000.0     84
46000.0     74
36000.0     72
          ...
55950.0      1
65950.0      1
60350.0      1
68900.0      1
26000.0      1
Name: count, Length: 483, dtype: int64

In [163]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2444 entries, 0 to 2443
Data columns (total 19 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   titles          2444 non-null   object
 1   rooms           2444 non-null   float64
 2   areas           2444 non-null   float64
 3   renovations     2444 non-null   object
 4   materials       2444 non-null   object
 5   prices          2444 non-null   float64
 6   addresses       2444 non-null   object
 7   lifts           2444 non-null   float64
 8   securities      2444 non-null   float64
 9   internets       2444 non-null   float64
 10  playgrounds     2444 non-null   float64
 11  sewerages       2444 non-null   float64
 12  bathrooms       2444 non-null   float64
 13  video_monitor   2444 non-null   float64
 14  parking_spaces  2444 non-null   float64
 15  air_conditions  2444 non-null   float64
 16  furnitures      2444 non-null   float64
 17  house_floor     2444 non-null   float64
 18  floor_th        2444 non-null   float64
dtypes: float64(15), object(4)
memory usage: 362.9+ KB